# CropBoxVisible Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWFExportOptions..::..CropBoxVisible Property
DWFExportOptions Class See Also
---
Whether to export crop box.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool CropBoxVisible { get; set; }
```

Visual Basic
---
```text
Public Property CropBoxVisible As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool CropBoxVisible {
	bool get ();
	void set (bool value);
}
```

# Remarks
The default value is false.
# See Also
DWFExportOptions Class
Autodesk.Revit.DB Namespace